CyberCastle/PIC32-MCU-Compiler/pic32-part-support/proc/32MX275F256B/p32mx275f256b.h
extern volatile __DSGPR16bits_t DSGPR16bits __asm__ ("DSGPR16") __attribute__((section("sfrs"), address(0xBF80007C)));
#define DSGPR17 DSGPR17
extern volatile uint32_t   DSGPR17 __attribute__((section("sfrs"), address(0xBF800080)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR17bits_t;
extern volatile __DSGPR17bits_t DSGPR17bits __asm__ ("DSGPR17") __attribute__((section("sfrs"), address(0xBF800080)));
#define DSGPR18 DSGPR18
extern volatile uint32_t   DSGPR18 __attribute__((section("sfrs"), address(0xBF800084)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR18bits_t;
extern volatile __DSGPR18bits_t DSGPR18bits __asm__ ("DSGPR18") __attribute__((section("sfrs"), address(0xBF800084)));
#define DSGPR19 DSGPR19
extern volatile uint32_t   DSGPR19 __attribute__((section("sfrs"), address(0xBF800088)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR19bits_t;
extern volatile __DSGPR19bits_t DSGPR19bits __asm__ ("DSGPR19") __attribute__((section("sfrs"), address(0xBF800088)));
#define DSGPR20 DSGPR20
extern volatile uint32_t   DSGPR20 __attribute__((section("sfrs"), address(0xBF80008C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR20bits_t;
extern volatile __DSGPR20bits_t DSGPR20bits __asm__ ("DSGPR20") __attribute__((section("sfrs"), address(0xBF80008C)));
#define DSGPR21 DSGPR21
extern volatile uint32_t   DSGPR21 __attribute__((section("sfrs"), address(0xBF800090)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR21bits_t;
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF800090)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF800094)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF800094)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF800098)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
extern volatile __DSGPR23bits_t DSGPR23bits __asm__ ("DSGPR23") __attribute__((section("sfrs"), address(0xBF800098)));
#define DSGPR24 DSGPR24
extern volatile uint32_t   DSGPR24 __attribute__((section("sfrs"), address(0xBF80009C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR24bits_t;
extern volatile __DSGPR24bits_t DSGPR24bits __asm__ ("DSGPR24") __attribute__((section("sfrs"), address(0xBF80009C)));
#define DSGPR25 DSGPR25
extern volatile uint32_t   DSGPR25 __attribute__((section("sfrs"), address(0xBF8000A0)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR25bits_t;
extern volatile __DSGPR25bits_t DSGPR25bits __asm__ ("DSGPR25") __attribute__((section("sfrs"), address(0xBF8000A0)));
#define DSGPR26 DSGPR26
extern volatile uint32_t   DSGPR26 __attribute__((section("sfrs"), address(0xBF8000A4)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR26bits_t;
extern volatile __DSGPR26bits_t DSGPR26bits __asm__ ("DSGPR26") __attribute__((section("sfrs"), address(0xBF8000A4)));
#define DSGPR27 DSGPR27
extern volatile uint32_t   DSGPR27 __attribute__((section("sfrs"), address(0xBF8000A8)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR27bits_t;
extern volatile __DSGPR27bits_t DSGPR27bits __asm__ ("DSGPR27") __attribute__((section("sfrs"), address(0xBF8000A8)));
#define DSGPR28 DSGPR28
extern volatile uint32_t   DSGPR28 __attribute__((section("sfrs"), address(0xBF8000AC)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR28bits_t;
extern volatile __DSGPR28bits_t DSGPR28bits __asm__ ("DSGPR28") __attribute__((section("sfrs"), address(0xBF8000AC)));
#define DSGPR29 DSGPR29
extern volatile uint32_t   DSGPR29 __attribute__((section("sfrs"), address(0xBF8000B0)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR29bits_t;
extern volatile __DSGPR29bits_t DSGPR29bits __asm__ ("DSGPR29") __attribute__((section("sfrs"), address(0xBF8000B0)));
#define DSGPR30 DSGPR30
extern volatile uint32_t   DSGPR30 __attribute__((section("sfrs"), address(0xBF8000B4)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR30bits_t;
extern volatile __DSGPR30bits_t DSGPR30bits __asm__ ("DSGPR30") __attribute__((section("sfrs"), address(0xBF8000B4)));
#define DSGPR31 DSGPR31
extern volatile uint32_t   DSGPR31 __attribute__((section("sfrs"), address(0xBF8000B8)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR31bits_t;
extern volatile __DSGPR31bits_t DSGPR31bits __asm__ ("DSGPR31") __attribute__((section("sfrs"), address(0xBF8000B8)));
#define DSGPR32 DSGPR32
extern volatile uint32_t   DSGPR32 __attribute__((section("sfrs"), address(0xBF8000BC)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR32bits_t;
extern volatile __DSGPR32bits_t DSGPR32bits __asm__ ("DSGPR32") __attribute__((section("sfrs"), address(0xBF8000BC)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF800200)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF800200)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF800204)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF800208)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF80020C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF800210)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF800210)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF800214)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF800218)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF80021C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF800220)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF800220)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF800224)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF800228)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF80022C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF800230)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
